Documents/омг_ВедениеМаршрутаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_ВедениеМаршрутаЛечения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПозицийМаршрута</xr:Item>
				<xr:Item>InformationRegister.КорректировкиПланаЛечения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНазначения</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияПозицииМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКорректировокПланаЛечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНазначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дозировка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриемовВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСтатус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПозицииПланаМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПозицииПланаМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемовВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭтапыНазначенийПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыНазначенийПланаЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапМаршрутаПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АвтоСтатусыПозицийМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АвтоСтатусыПозицийМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПозицийМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПозицийМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыполненияПозицииМаршрута</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКорректировокПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКорректировокПланаЛечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавлениеПозиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалениеПозиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПозиции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыВыполненияПозицииМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыВыполненияПозицииМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обследование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процедура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/омг_ВедениеМаршрутаЛечения/Forms/ФормаДокумента_85/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПозицииПоПлану(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПервичныйПрием)
		ИЛИ Не ЗначениеЗаполнено(Объект.СтандартЛечения) Тогда
		ПоказатьПредупреждение(, "Заполните первичный приём и стандарт лечения.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПозицииПоПлануНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПозицииПоПлануНаСервере()
	АвтоСтатусыСервер.ПересчитатьАвтоСтатусыМаршрута(Объект.ПервичныйПрием, Объект.СтандартЛечения);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", Объект.ПервичныйПрием);
	Запрос.УстановитьПараметр("СтандартЛечения", Объект.СтандартЛечения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Позиции.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ВидНазначения КАК ВидНазначения,
	|	Позиции.ДатаНачала КАК ДатаНачала,
	|	Позиции.ДатаОкончания КАК ДатаОкончания,
	|	Позиции.Количество КАК Количество,
	|	Позиции.Дозировка КАК Дозировка,
	|	Позиции.ПриемовВДень КАК ПриемовВДень,
	|	Позиции.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Этапы.ЭтапМаршрутаПациента КАК Этап
	|ИЗ
	|	РегистрСведений.ПозицииПланаМаршрута КАК Позиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭтапыНазначенийПланаЛечения КАК Этапы
	|		ПО Позиции.ИдентификаторНазначения = Этапы.ИдентификаторНазначения
	|			И Позиции.ПервичныйПрием = Этапы.ПервичныйПрием
	|ГДЕ
	|	Позиции.ПервичныйПрием = &ПервичныйПрием
	|	И Позиции.СтандартЛечения = &СтандартЛечения";
	
	Объект.Позиции.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Позиции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ЗаполнитьТекущиеСтатусыПозиций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПлановоеПолеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Позиции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Удалённую позицию не помечаем «Изменением» — удаление сильнее.
	Если ТекущиеДанные.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Если строка уже отмечена как «Добавление» — оставляем добавление.
	Если ТекущиеДанные.Действие
			= ПредопределенноеЗначение("Перечисление.ВидыКорректировокПланаЛечения.ДобавлениеПозиции") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Действие = ПредопределенноеЗначение(
		"Перечисление.ВидыКорректировокПланаЛечения.ИзменениеПозиции");
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПометкаУдаленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Позиции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПометкаУдаления Тогда
		ТекущиеДанные.Действие = ПредопределенноеЗначение(
			"Перечисление.ВидыКорректировокПланаЛечения.УдалениеПозиции");
	Иначе
		// Сняли пометку удаления — действие очищаем (потом, если врач что-то правил,
		// ПриИзменении плановых полей выставит «Изменение» заново).
		ТекущиеДанные.Действие = ПредопределенноеЗначение(
			"Перечисление.ВидыКорректировокПланаЛечения.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	// Дадим стандартному механизму добавить пустую строку, и сразу её настроим.
	ПодключитьОбработчикОжидания("ПозицииНастройкаНовойСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииНастройкаНовойСтроки()
	
	ТекущиеДанные = Элементы.Позиции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторНазначения) Тогда
		ТекущиеДанные.ИдентификаторНазначения = Новый УникальныйИдентификатор();
		ТекущиеДанные.Действие = ПредопределенноеЗначение(
			"Перечисление.ВидыКорректировокПланаЛечения.ДобавлениеПозиции");
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТекущиеСтатусыПозиций()
	
	Если Не ЗначениеЗаполнено(Объект.ПервичныйПрием)
		ИЛИ Не ЗначениеЗаполнено(Объект.СтандартЛечения) Тогда
		Возврат;
	КонецЕсли;
	
	АвтоСтатусы = ПолучитьАвтоСтатусыНаСервере(Объект.ПервичныйПрием, Объект.СтандартЛечения);
	РучныеСтатусы = ПолучитьРучныеСтатусыНаСервере(Объект.ПервичныйПрием);
	
	Для Каждого СтрокаПозиции Из Объект.Позиции Цикл
		
		Ид = СтрокаПозиции.ИдентификаторНазначения;
		
		РучнойСтатус = РучныеСтатусы.Получить(Ид);
		Если РучнойСтатус <> Неопределено И ЗначениеЗаполнено(РучнойСтатус) Тогда
			СтрокаПозиции.ТекущийСтатус = РучнойСтатусВПредставление(РучнойСтатус);
			Продолжить;
		КонецЕсли;
		
		АвтоСтатус = АвтоСтатусы.Получить(Ид);
		Если АвтоСтатус <> Неопределено И ЗначениеЗаполнено(АвтоСтатус) Тогда
			СтрокаПозиции.ТекущийСтатус = АвтоСтатус;
			Продолжить;
		КонецЕсли;
		
		СтрокаПозиции.ТекущийСтатус = "";
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАвтоСтатусыНаСервере(ПервичныйПрием, СтандартЛечения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.УстановитьПараметр("СтандартЛечения", СтандартЛечения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвтоСтатусы.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	АвтоСтатусы.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.АвтоСтатусыПозицийМаршрута КАК АвтоСтатусы
	|ГДЕ
	|	АвтоСтатусы.ПервичныйПрием = &ПервичныйПрием
	|	И АвтоСтатусы.СтандартЛечения = &СтандартЛечения";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторНазначения, Выборка.Статус);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРучныеСтатусыНаСервере(ПервичныйПрием)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статусы.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	Статусы.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыПозицийМаршрута КАК Статусы
	|ГДЕ
	|	Статусы.ПервичныйПрием = &ПервичныйПрием";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторНазначения, Выборка.Статус);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РучнойСтатусВПредставление(СтатусПеречисления)
	
	Если СтатусПеречисления = ПредопределенноеЗначение(
			"Перечисление.СтатусыВыполненияПозицииМаршрута.Выполнено") Тогда
		Возврат "выполнено";
	ИначеЕсли СтатусПеречисления = ПредопределенноеЗначение(
			"Перечисление.СтатусыВыполненияПозицииМаршрута.Выполняется") Тогда
		Возврат "в работе";
	ИначеЕсли СтатусПеречисления = ПредопределенноеЗначение(
			"Перечисление.СтатусыВыполненияПозицииМаршрута.Отказ") Тогда
		Возврат "отказ";
	ИначеЕсли СтатусПеречисления = ПредопределенноеЗначение(
			"Перечисление.СтатусыВыполненияПозицииМаршрута.Отменено") Тогда
		Возврат "отменено";
	КонецЕсли;
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АвтоСтатусыСервер.ПересчитатьАвтоСтатусыМаршрута(
		ТекущийОбъект.ПервичныйПрием, ТекущийОбъект.СтандартЛечения);
	ЗаполнитьТекущиеСтатусыПозиций();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМедикамент(Команда)
	Если Не ПроверитьШапкуМаршрута() Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФормуМедикамента(Неопределено, Истина);
КонецПроцедуры
&НаКлиенте
Функция ПроверитьШапкуМаршрута()
	
	Если Не ЗначениеЗаполнено(Объект.ПервичныйПрием)
		ИЛИ Не ЗначениеЗаполнено(Объект.СтандартЛечения) Тогда
		ПоказатьПредупреждение(, "Заполните первичный приём и стандарт лечения.");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуМедикамента(ИдСтроки, ЭтоНовый)
	
	ДанныеЗаполнения = Новый Структура;
	Если Не ЭтоНовый Тогда
		Стр = Объект.Позиции.НайтиПоИдентификатору(ИдСтроки);
		Если Стр = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДанныеЗаполнения.Вставить("Назначение", Стр.Номенклатура);
		ДанныеЗаполнения.Вставить("Дата", Стр.ДатаНачала);
		ДанныеЗаполнения.Вставить("ДатаОкончания", Стр.ДатаОкончания);
		ДанныеЗаполнения.Вставить("Количество", Стр.Количество);
		ДанныеЗаполнения.Вставить("Дозировка", Стр.Дозировка);
		ДанныеЗаполнения.Вставить("ПриемовВДень", Стр.ПриемовВДень);
		ДанныеЗаполнения.Вставить("ЕдиницаИзмерения", Стр.ЕдиницаИзмерения);
		ДанныеЗаполнения.Вставить("Комментарий", Стр.Комментарий);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Источник", "Прием");
	ПараметрыФормы.Вставить("ДанныеЗаполнения", ДанныеЗаполнения);
	Если ЭтоНовый Тогда
		ПараметрыФормы.Вставить("НоваяСтрока", Истина);
	КонецЕсли;
	
	ДопПарам = Новый Структура("ЭтоНовый, ИдСтроки", ЭтоНовый, ИдСтроки);
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуМедикамента_Завершение", ЭтотОбъект, ДопПарам);
	ОткрытьФорму("ОбщаяФорма.РедактированиеМедикаментозныхНазначений", ПараметрыФормы, ЭтотОбъект,
		, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецПроцедуры
	&НаКлиенте
Процедура ОткрытьФормуМедикамента_Завершение(Результат, ДопПарам) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат; // Отмена.
	КонецЕсли;
	
	Если ДопПарам.ЭтоНовый Тогда
		Стр = Объект.Позиции.Добавить();
		Стр.ИдентификаторНазначения = Новый УникальныйИдентификатор();
		Стр.ВидНазначения = ПредопределенноеЗначение("Перечисление.ВидыНазначений.Медикаменты");
		Стр.Действие = ПредопределенноеЗначение(
			"Перечисление.ВидыКорректировокПланаЛечения.ДобавлениеПозиции");
	Иначе
		Стр = Объект.Позиции.НайтиПоИдентификатору(ДопПарам.ИдСтроки);
		Если Стр = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если Стр.Действие <> ПредопределенноеЗначение(
				"Перечисление.ВидыКорректировокПланаЛечения.ДобавлениеПозиции") Тогда
			Стр.Действие = ПредопределенноеЗначение(
				"Перечисление.ВидыКорректировокПланаЛечения.ИзменениеПозиции");
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("Назначение") Тогда       Стр.Номенклатура = Результат.Назначение;       КонецЕсли;
	Если Результат.Свойство("Дата") Тогда             Стр.ДатаНачала = Результат.Дата;               КонецЕсли;
	Если Результат.Свойство("ДатаОкончания") Тогда    Стр.ДатаОкончания = Результат.ДатаОкончания;    КонецЕсли;
	Если Результат.Свойство("Количество") Тогда       Стр.Количество = Результат.Количество;          КонецЕсли;
	Если Результат.Свойство("Дозировка") Тогда        Стр.Дозировка = Результат.Дозировка;            КонецЕсли;
	Если Результат.Свойство("ПриемовВДень") Тогда     Стр.ПриемовВДень = Результат.ПриемовВДень;      КонецЕсли;
	Если Результат.Свойство("ЕдиницаИзмерения") Тогда Стр.ЕдиницаИзмерения = Результат.ЕдиницаИзмерения; КонецЕсли;
	Если Результат.Свойство("Комментарий") Тогда      Стр.Комментарий = Результат.Комментарий;        КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииВыбор(Элемент, Строка, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Позиции.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Спец-форму открываем только для медикаментов; остальное — обычное редактирование.
	Если ТекущиеДанные.ВидНазначения
			<> ПредопределенноеЗначение("Перечисление.ВидыНазначений.Медикаменты") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуМедикамента(Строка, Ложь);
КонецПроцедуры
